2024-08-08-parallel-evm:-blockworks-bigger-picture.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta
      name="description"
      content="This is a personal note for [[https://blockworks.co/news/parallelized-evms-gaining-popularity][Blockworks news (12.01.2024)]]"
    />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://chenyo-17.github.io/org-static-blog/rss.xml"
      title="RSS feed for https://chenyo-17.github.io/org-static-blog"
    />
    <title>Parallel EVM: Blockworks news (Sei, Monad, Solana)</title>
    <meta name="author" content="chenyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link rel="stylesheet" href="static/style.css" type="text/css" />
  </head>
  <body>
    <div id="preamble" class="status">
      <header>
        <h1>
          <a href="https://chenyo-17.github.io/org-static-blog"
            >Chenyo's org-static-blog</a
          >
        </h1>
        <nav>
          <a href="https://chenyo-17.github.io/org-static-blog">Home</a>
          <a href="https://chenyo-17.github.io/org-static-blog/archive.html"
            >Archive</a
          >
          <a href="https://chenyo-17.github.io/org-static-blog/tags.html"
            >Tags</a
          >
        </nav>
      </header>
    </div>
    <div id="content">
      <div class="post-date">08 Aug 2024</div>
      <h1 class="post-title">
        <a
          href="https://chenyo-17.github.io/org-static-blog/2024-08-08-parallel-evm:-blockworks-bigger-picture.html"
          >Parallel EVM: Blockworks news (Sei, Monad, Solana)</a
        >
      </h1>
      <nav id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li>
              <a href="#orgd549c4d">1. Terminology</a>
              <ul>
                <li><a href="#orge21af57">1.1. Ethereum sharding</a></li>
                <li><a href="#org3c9759d">1.2. Blob</a></li>
                <li><a href="#orga4cdf86">1.3. Erasure coding</a></li>
                <li>
                  <a href="#orge2fcf26"
                    >1.4. Data availability sampling (DAS)</a
                  >
                </li>
                <li>
                  <a href="#org9ecc557">1.5. Danksharding (L2 optimization)</a>
                </li>
                <li>
                  <a href="#orgf3da975"
                    >1.6. Relations between L1 and L2 scaling</a
                  >
                </li>
                <li>
                  <a href="#orgbec0792">1.7. Double spending prevention</a>
                </li>
                <li><a href="#orgc3cdb60">1.8. Sealevel (Solana)</a></li>
              </ul>
            </li>
            <li>
              <a href="#orgc9c86c7">2. Ways to achieve parallel processing</a>
            </li>
            <li>
              <a href="#orgd888ea6"
                >3. Production-ready parallelized EVM projects (Jan 2024)</a
              >
            </li>
          </ul>
        </div>
      </nav>
      <p>
        This is a personal note for
        <a
          href="https://blockworks.co/news/parallelized-evms-gaining-popularity"
          >Blockworks news (12.01.2024)</a
        >
        as well as some terminology explained online, e.g.,
        <a
          href="https://www.coindesk.com/learn/what-is-ethereum-sharding-a-beginners-guide/"
          >Coindesk</a
        >
        and
        <a href="https://chatgpt.com/c/824f05c9-dc75-4eb6-aeda-59d057baf83a"
          >GPT-4o</a
        >.
      </p>
      <div id="outline-container-orgd549c4d" class="outline-2">
        <h2 id="orgd549c4d">
          <span class="section-number-2">1.</span> Terminology
        </h2>
        <div class="outline-text-2" id="text-1"></div>
        <div id="outline-container-orge21af57" class="outline-3">
          <h3 id="orge21af57">
            <span class="section-number-3">1.1.</span> Ethereum sharding
          </h3>
          <div class="outline-text-3" id="text-1-1">
            <ul class="org-ul">
              <li>
                The Ethereum mainnet is divided into smaller interconnected
                networks called shards.
              </li>
              <li>
                Each shard processes and validates its own transactions parallel
                to others.
              </li>
              <li>
                Pros: increase scalability and <b><b>participation</b></b
                >.
              </li>
              <li>
                Cons: a single unit can be compromised; lead to centralization.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org3c9759d" class="outline-3">
          <h3 id="org3c9759d">
            <span class="section-number-3">1.2.</span> Blob
          </h3>
          <div class="outline-text-3" id="text-1-2">
            <ul class="org-ul">
              <li>
                Rather than storing each transaction data directly in the
                blockchain, the data is aggregated into a blob (binary object).
              </li>
              <li>
                Each blob performs erasure coding to dive the blob into multiple
                smaller pieces with redundancy.
              </li>
              <li>
                Encoded pieces are stored separately, the block header contain
                pointers to the piece locations without storing actual data.
              </li>
              <li>
                Transactions in a block may be distributed across multiple
                blobs.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-orga4cdf86" class="outline-3">
          <h3 id="orga4cdf86">
            <span class="section-number-3">1.3.</span> Erasure coding
          </h3>
          <div class="outline-text-3" id="text-1-3">
            <ul class="org-ul">
              <li>
                Allows one to encode blobs such that if at least half of the
                data in the blob is published, anyone in the network can
                reconstruct and re-publish the rest of the data.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-orge2fcf26" class="outline-3">
          <h3 id="orge2fcf26">
            <span class="section-number-3">1.4.</span> Data availability
            sampling (DAS)
          </h3>
          <div class="outline-text-3" id="text-1-4">
            <ul class="org-ul">
              <li>
                Validators randomly sample blob pieces to confirm the data can
                be reconstructed.g
              </li>
              <li>
                If a client cannot get enough pieces to verify the blob
                availability, or the blob fails the integrity check, or
                transactions within the blob are invalid or inconsistent with
                the blockchain state, the blob is rejected.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org9ecc557" class="outline-3">
          <h3 id="org9ecc557">
            <span class="section-number-3">1.5.</span> Danksharding (L2
            optimization)
          </h3>
          <div class="outline-text-3" id="text-1-5">
            <ul class="org-ul">
              <li>A specific sharding implementation proposal.</li>
              <li>
                Require data availability sampling and
                <a
                  href="https://chenyo-17.github.io/org-static-blog/tag-evm.html#orgf2db0ef"
                  >proposer-builder separation</a
                >.
              </li>
              <li>Can support hundreds of individual rollups.</li>
            </ul>
          </div>
        </div>
        <div id="outline-container-orgf3da975" class="outline-3">
          <h3 id="orgf3da975">
            <span class="section-number-3">1.6.</span> Relations between L1 and
            L2 scaling
          </h3>
          <div class="outline-text-3" id="text-1-6">
            <ul class="org-ul">
              <li>
                L1 scaling: optimizations directly to the Ethereum mainnet and
                core infrastructure, e.g., parallel EVM.
              </li>
              <li>
                L2 scaling: building secondary rollup layers, e.g., optimistic
                rollups and ZK rollups, to offload mainnet computation and
                storage.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-orgbec0792" class="outline-3">
          <h3 id="orgbec0792">
            <span class="section-number-3">1.7.</span> Double spending
            prevention
          </h3>
          <div class="outline-text-3" id="text-1-7">
            <ul class="org-ul">
              <li>
                Bitcoin: uses UTXOs to track which inputs have been spent (no
                need to go through the entire chain).
              </li>
              <li>
                Ethereum: uses a nounce to track the number of transactions sent
                from an account, the nounce is included in the transaction and
                is incremented by 1 for every new transaction, and all
                transactions must be executed in order.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-orgc3cdb60" class="outline-3">
          <h3 id="orgc3cdb60">
            <span class="section-number-3">1.8.</span> Sealevel (Solana)
          </h3>
          <div class="outline-text-3" id="text-1-8">
            <ul class="org-ul">
              <li>
                Solana&rsquo;s parallel smart contract runtime to process
                thousands of contracts in parallel.
              </li>
              <li>
                Solana transactions describe all states a transaction accesses
                to efficiently recognize transaction dependency and to schedule
                parallel execution without accessing full blockchain state.
              </li>
            </ul>
          </div>
        </div>
      </div>
      <div id="outline-container-orgc9c86c7" class="outline-2">
        <h2 id="orgc9c86c7">
          <span class="section-number-2">2.</span> Ways to achieve parallel
          processing
        </h2>
        <div class="outline-text-2" id="text-2">
          <ul class="org-ul">
            <li>Process independent transactions in parallel.</li>
            <li>Sharding.</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgd888ea6" class="outline-2">
        <h2 id="orgd888ea6">
          <span class="section-number-2">3.</span> Production-ready parallelized
          EVM projects (Jan 2024)
        </h2>
        <div class="outline-text-2" id="text-3">
          <ul class="org-ul">
            <li>Sei: optimistic parallel execution.</li>
            <li>
              Monad: custom EVM implementation, optimistic parallel execution,
              <b><b>custom state database</b></b
              >.
              <ul class="org-ul">
                <li>
                  Commodity databases are not optimized for Merkle tree data
                  read/write with SSD.
                </li>
              </ul>
            </li>
            <li>Neon (Solana): transactions pre-specify dependencies.</li>
            <li>
              See
              <a
                href="https://chenyo-17.github.io/org-static-blog/tag-evm.html#orgcb5510d"
                >BNB chain post</a
              >
              for more solutions.
            </li>
          </ul>
        </div>
      </div>
      <div class="taglist">
        <a href="https://chenyo-17.github.io/org-static-blog/tags.html">Tags</a
        >:
        <a href="https://chenyo-17.github.io/org-static-blog/tag-evm.html"
          >evm</a
        >
        <a
          href="https://chenyo-17.github.io/org-static-blog/tag-parallel-evm.html"
          >parallel-evm</a
        >
        <a
          href="https://chenyo-17.github.io/org-static-blog/tag-blockworks.html"
          >blockworks</a
        >
      </div>
    </div>
    <div id="postamble" class="status">
      <footer>
        <p>© 2024 chenyo. Some rights reserved.</p>
      </footer>
    </div>
  </body>
</html>
